package lesson1.task12;
/**
 * Напишите метод который принимает математическое выражение в формате String и возвращает результат.
 * В выражении используются только целые числа, поддерживаемые операции:+,-.
 * Пример:
 * 	math("2-1"); // вернёт [1]
 * 	math("2- +1"); // вернёт [1]
 * 	math(" 2-  -1"); // вернёт [3]
 */
public class Main {
public static void main (){
 //   System.out.print(math("2-1"));
 ///   System.out.print(math("2- +1"));
    //System.out.print(math("2-  -1"));
}

private static void math (String str){


}


}
